app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies"
---
    def index
      if params[:sort] == "title"
        @movies = Movie.all.order(title: :asc)
        @title = "hilite"
      @elsif params[:sort] == "release_date"
        @movies = Movie.all.order(release_date: :asc)
        @release_date = "hilite"
      else
        @movies = Movie.all